src/xml/request/formatReceiptRequest.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope" xmlns:ofo="http://oss.dbc.dk/ns/openfindorder">
<SOAP-ENV:Body>
  <ofo:formatReceiptRequest>
     <!--Optional:-->
     <ofo:authentication>
        <ofo:groupIdAut>?</ofo:groupIdAut>
        <ofo:passwordAut>?</ofo:passwordAut>
        <ofo:userIdAut>?</ofo:userIdAut>
     </ofo:authentication>
     <ofo:json>?</ofo:json>
     <!--Optional:-->
     <ofo:outputType>?</ofo:outputType>
     <!--Optional:-->
     <ofo:callback>?</ofo:callback>
  </ofo:formatReceiptRequest>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>

<!-- json example: 
{
"orderId":"9876543210",
"requesterId":"123123",
"active":true,
"activeId":263,
"articleDirect":"",
"articleFirstNote":"",
"author":"Ravelli, Emmanuel",
"authorOfComponent":"",
"autMatType":"",
"autoForwardDeliverToday":"",
"autoForwardOwn":"",
"autoForwardReason":"",
"autoForwardResult":"",
"autCreationDate":null,
"bibliographicCategory":"mono",
"bibliographicRecordAgencyId":"125320",
"bibliographicRecordId":"1231231231",
"callNumber":"",
"cancelled":"",
"cancelledDate":null,
"closed":false,
"closedDate":null,
"copy":false,
"creationDate":"2014-06-02T12:27:35.000Z",
"dateDue":null,
"desiredDateDue":null,
"edition":"First Fubar edition",
"exactEdition":false,
"expectedDelivery":null,
"forwardOrderId":"",
"fullTextLink":"",
"fullTextLinkType":"",
"isbn":"9780123123123",
"issn":"",
"isRecalled":false,
"isShipped":false,
"issue":"",
"itemId":"",
"kvik":false,
"language":"",
"lastRelevantModification":null,
"lastRenewalDate":null,
"latestProviderNote":"",
"latestRequesterNote":"",
"localHoldingsId":"",
"lookedUpUserId":"",
"mediumType":"a xx",
"needBeforeDate":"2099-12-01T23:00:00.000Z",
"norfri":false,
"numberOfRecalls":0,
"numberOfRenewals":0,
"orderSystem":"netpunkt",
"orderType":"inter_library_request",
"originalOrderId":"",
"pagination":"",
"pickUpAgencyId":"123124",
"pickUpAgencySubdivision":"",
"pid":"",
"pidOfComponent":"",
"pidOfPrimaryObject":"D722297903",
"placeOfPublication":"New York",
"placeOnHold":"responder_depending",
"providerAnswer":"",
"providerAnswerDate":null,
"providerAnswerReason":"",
"providerOrderState":"",
"publicationDate":"1932",
"publicationDateOfComponent":"",
"publisher":"Flywheel, Flywheel and Shyster",
"recalledDate":null,
"receivedDate":null,
"renewed":"",
"renewPendingDate":null,
"requesterInitials":"",
"requesterOrderState":"",
"resendToRequesterDate":null,
"resendToResponderDate":null,
"responderId":"765765",
"returnedDate":null,
"seriesTitleNumber":"",
"shippedDate":null,
"shippedServiceType":"",
"title":"The Ocean Cruise",
"titleOfComponent":"",
"userAddress":"",
"userAgencyId":"",
"userDateOfBirth":"",
"userId":"1231231230",
"userIdAuthenticated":"",
"userIdType":"cardno",
"userMail":"",
"userName":"",
"userReferenceSource":"",
"userTelephone":"",
"verificationReferenceSource":"danbib",
"volume":"",
"wantsReceipt":"yes",
"worldCatNote":""
 }
-->